---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ExternallyTaggedGeometryObject Properties
ExternallyTaggedGeometryObject Class See Also Send Feedback
---

The ExternallyTaggedGeometryObject type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | ExternalId | The external Id of the geometry object. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ExternallyTaggedGeometryObject Class

Autodesk.Revit.DB Namespace